{
  "\\Users\\AMD\\vidhra\\internal\\ast\\google-cloud-python\\packages\\google-cloud-gke-connect-gateway\\google\\cloud\\gkeconnect\\gateway_v1beta1\\types\\control.py": [
    {
      "type": "request_class",
      "name": "GenerateCredentialsRequest",
      "docstring": "A request for connection information for a particular\nmembership.\n\nAttributes:\n    name (str):\n        Required. The Fleet membership resource.\n    force_use_agent (bool):\n        Optional. Whether to force the use of Connect\n        Agent-based transport.\n        This will return a configuration that uses\n        Connect Agent as the underlying transport\n        mechanism for cluster types that would otherwise\n        have used a different transport. Requires that\n        Connect Agent be installed on the cluster.\n        Setting this field to false is equivalent to not\n        setting it.\n    version (str):\n        Optional. The Connect Gateway version to be\n        used in the resulting configuration.\n\n        Leave this field blank to let the server choose\n        the version (recommended).\n    kubernetes_namespace (str):\n        Optional. The namespace to use in the kubeconfig context.\n\n        If this field is specified, the server will set the\n        ``namespace`` field in kubeconfig context. If not s",
      "attributes": {
        "name": {
          "type": "str",
          "description": "Required. The Fleet membership resource."
        },
        "force_use_agent": {
          "type": "bool",
          "description": "Optional. Whether to force the use of Connect Agent-based transport. This will return a configuration that uses Connect Agent as the underlying transport mechanism for cluster types that would otherwise have used a different transport. Requires that Connect Agent be installed on the cluster. Setting this field to false is equivalent to not setting it."
        },
        "version": {
          "type": "str",
          "description": "Optional. The Connect Gateway version to be used in the resulting configuration.  Leave this field blank to let the server choose the version (recommended)."
        },
        "kubernetes_namespace": {
          "type": "str",
          "description": "Optional. The namespace to use in the kubeconfig context.  If this field is specified, the server will set the ``namespace`` field in kubeconfig context. If not specified, the ``namespace`` field is omitted."
        },
        "operating_system": {
          "type": "google.cloud.gkeconnect.gateway_v1beta1.types.GenerateCredentialsRequest.OperatingSystem",
          "description": "Optional. The operating system where the kubeconfig will be used."
        }
      }
    },
    {
      "type": "request_class",
      "name": "GenerateCredentialsResponse",
      "docstring": "Connection information for a particular membership.\n\nAttributes:\n    kubeconfig (bytes):\n        A full YAML kubeconfig in serialized format.\n    endpoint (str):\n        The generated URI of the cluster as accessed\n        through the Connect Gateway API.",
      "attributes": {
        "kubeconfig": {
          "type": "bytes",
          "description": "A full YAML kubeconfig in serialized format."
        },
        "endpoint": {
          "type": "str",
          "description": "The generated URI of the cluster as accessed through the Connect Gateway API."
        }
      }
    }
  ]
}